public class F001_Variables {
    public static void main(String[] args) {

        // Объявление переменной типа int и присвоение ей значения 30
        int myAge = 30; // int: 32-битное целое число со знаком. Диапазон от -2^31 до 2^31-1.

        // Вывод значения переменной myAge в консоль
        System.out.println(myAge); // При выполнении программы в консоли будет отображено число `30`.


    }
}
/*
Ваш класс `Types` в Java является простым примером, демонстрирующим объявление и
использование переменной целочисленного типа `int`.

Давайте разберем ваш код подробнее:

    1. **Класс `Types`**: Это основной класс вашего файла Java.
        В Java, каждый файл обычно содержит один публичный класс, имя которого соответствует имени файла.

    2. **Метод `main`**: Это точка входа в вашу программу.
        Когда вы запускаете программу, исполнение начинается именно с метода `main`.

    3. **Переменная `myAge`**:
    - `int myAge = 30;` - здесь вы объявляете переменную `myAge` типа `int` и инициализируете ее значением `30`.
    - Тип `int` - это 32-битное целое число со знаком, что означает,
            что оно может содержать значения от -2^31 до 2^31-1 (от -2,147,483,648 до 2,147,483,647).

    4. **Вывод в консоль**:
    `System.out.println(myAge);` - этот код выводит значение переменной `myAge` в консоль.
*/
